#include <stdio.h>

void main()
{
#pragma region 대입 연산자 (=)
	// 대입 연산자란 오른쪽에 있는 피 연산자(값,데이터)를
	// '=' 를 기준으로 왼쪽에 있는 피 연산자(변수,대상)에
	// 저장하는 것.

	// 수학적으로 접근하면 
	// a = b -----> a와 b는 같다 이지만
	// 프로그래밍에서는 
	// a = b -----> a에 b의 값을 넣는다 라는 뜻이다.

	// 그러므로 '='는 '같다' 가 아닌 '값을 넣는다'로
	// 생각하는 것이 옳다.
	
	int i = 3246;

	// 위의 변수 선언을 보고 
	// 수학적 접근 시 i 와 3246은 같다 라고 해석된다.
	
	// 다만 프로그래밍 언어에서 접근은
	// i에 3246이라는 데이터를 저장한다 라는 뜻이다.

	// ex ) i 라는 이름의 변수는 {},()안에
	// 단 하나 밖에 존재하지 않는 이름이지만
	// 3246이라는 숫자는 어디에든 쓰일 수 있다.
	// 그렇기에 같은 것이 아니라고 생각하는 것이 옳다.

	// 이것 말고도 복합대입 연산자라고 있는데
	// 연산을 하고 대입하는 행위를 단축한다고 보면된다.
	// 쓰일 수 있는 복합대입 연산자의 종류는 아래와 같다.
	// += , -= , %= , ^= ,/= , &= ,<<= 
	// 아래 예시를 보자

	int a = 10;
	int b = 5;

	a 

#pragma endregion

}
